// 2. Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result.
//     Выведите на экран значение переменной result.
var c=15, d=2;
var result = c + d;
alert(result);

/ 3. Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.
var a=10, b=2, c=5;
var summ = a + b + c;
alert(summ);

// 4. Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.
//     Затем создайте переменную d, присвойте ей значение 7.
// 5. Сложите переменные c и d, а результат запишите в переменную result.
//     Выведите на экран значение переменной result.
var a=17, b=10;
var c = a - b;
var d = 7;
var result = c + d;
alert(result);

// 6. Создайте переменную str и присвойте ей значение 'Привет, Мир!'.
//     Выведите значение этой переменной на экран.
var str = 'Привет, Мир!';
alert(str);

// 7. Создайте переменные str1='Привет, ' и str2='Мир!'.
//     С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.
var str1='Привет', str2='Мир';
alert(str1+str2);

// 8. Создайте переменную name и присвойте ей ваше имя. = Выведите на экран фразу 'Привет, %Имя%!'.
var f='Антон';
alert('Привет'+f)